class Hobby {
  String? name;
  String? band;
  bool? checked;

  Hobby(this.name, this.band, this.checked);

  static List<Hobby> getHobby() {
    return [
      Hobby('อ่านหนังสือ', 'ช่วยเสริมสร้างสมาธิ และช่วยผ่อนคลาย', false),
      Hobby(
          'เล่นเกมส์', 'ช่วยผ่อนคลาย แต่ควรเล่นหลังจากงานเสร็จหมดแล้ว', false),
      Hobby('เล่นดนตรี', 'ช่วยเพิ่มความเพลิดเพลิน และช่วยให้ภาพลักษณ์ดีขึ้น',
          false),
      Hobby('ทำอาหาร',
          'เสริมสร้างความสามารถด้านอาหารให้ตรงตามความต้องการมากที่สุด', false),
      Hobby('ออกกำลังกาย', 'ช่วยให้ร่างกาย ปราศจากโรคภัยไข้เจ็บ', false),
      Hobby('วาดรูป', 'ช่วยเพิ่มความสามารถ ที่จะนำไปพัฒนาต่อยอดในอนาคตได้',
          false),
      Hobby('เขียนหนังสือ', 'ช่วยเพิ่มความสามารถในด้านการเขียน', false),
    ];
  }
}
